module.exports.config = {
 name: "war",
 version: "1.0.0",
 hasPermssion: 2,
 credits: "Shahadat SAHU",
 description: "গালি টু গালি",
 commandCategory: "group",
 usages: "prefix+war",
 cooldowns: 2,
 dependencies: {
 "fs-extra": "",
 "axios": ""
 }
}

module.exports.run = async function({ api, args, Users, event}) {
 var mention = Object.keys(event.mentions)[0];
 let name = event.mentions[mention];
 var arraytag = [];
 arraytag.push({id: mention});
 
 var a = function (a) { api.sendMessage(a, event.threadID); }
 
 a("__-মাহির কে যে গালি দিবি তার আম্মু রে চুদি মাগির পোলা-!!😍😘");
 setTimeout(() => {a({body: "__-এই মুরগি খাংকির পোলা মাহির তর আম্মুর ভাতার লাগে বাস্ট্রাডের বাচ্ছা অনেক বড় গালি বাজ হয়ে গেছিস নাকি-!!😂🤣" })}, 3000);
 setTimeout(() => {a({body: "__-তর মত গালি বাজ আমি মাহির ৩৬৫ দিন চুদি মাগির পোলা-!!😅😆"})}, 5000);
 setTimeout(() => {a({body: "__-এই মুরগি শুন তর মারে চুদি আচারের লোভ দেখিয়ে-!!😋😋" })}, 7000);
 setTimeout(() => {a({body: "__-কিরে বস্তির পোলা তর মারে তর দুলাভাই এর কান্দে ফেলে আর তর কচি বোন রে তর বাপের কান্দে রেখে চুদি উফফফ-!!🥵💦" })}, 9000);
 setTimeout(() => {a({body: "__-খাংকির পোলা তুই মাহির কে গালি দেস তুই তো রাস্তার পতিতার পুত ছোট ভাই তর আম্মু রে টুস করে চুদে দিয়ে দূর দিবো-!!🐒🙈" })}, 12000);
 setTimeout(() => {a({body: "__-জারজ মাগির পোলা তর কচি বোনের ভুদায় উম্মম্মম্মম্মা-!!😋ওয়াক থু তর বোনের ভুদায় গন্ধ কাইল্লা মাগির পুত-!!🤬🤬" })}, 15000);
 setTimeout(() => {a({body: "__-কিরে ফকিন্নি মাগীর পোলা মুরগী-তোর মায়ের চুদতে চুদতে নিয়া যামু তুর্কী--তুর্কীকে আছে নাকি কী মামু--তোর বোনের কচি ভোদা কামাইয়া খামু-!!😋" })}, 17000);
 setTimeout(() => {a({body: "__-গুরু গুরু মহা গুরু আমি মাহির চোদা👉করলাম শুরু-তোর মার পুটকিতে ডুকামু ২টা গরু-গরু নাকি ডাকে হাম্বা তোর মার ভোদায় ডুকামু ২টা ইলেক্ট্রিকের খাম্বা-!!🤣😂" })}, 20000);
 setTimeout(() => {a({body: "__-চুইদ্দা তোর মার বোদা দিয়া বাইর করমু রক্ত-রক্তের কালার যদি হয় লাল তোর মারে চুদবো আমি তোর বাপ মাহির চিরকাল শুয়ারের বাচ্চা-!!😅😆" })}, 23000);
 setTimeout(() => {a({body: "__-তর মারে আমি চুদি রাস্তায়-বাঘ চুদে বনে-তোর বোনের কালা ভোদা চুদমু আমি ঘরের এক কনে 👒শুয়ারের বাচ্চা-গালি দেস মাহিররে কত সাহস-!!😃😄" })}, 25000);
 setTimeout(() => {a({body: "__-আমি গালি জানি না গালি গেছি ভুইলা তোর মায়ের চুদমু ছায়া ব্লাউজ খুইলা-তোর আাবল জাতের মায়ের চুদি খাংকির পোলা-!!🥵💦" })}, 28500);
 setTimeout(() => {a({body: "__-তোর মা বোনের ভোদায় শুটকি মাছের গন্ধ তোর মায়ের চুইদা করমু অনলাইনে অন্ধ-!!😎🥴" })}, 31000);
 setTimeout(() => {a({body: "__-অন্ধ হইয়া অনলাইনে করবি তুই ভিক্ষা তোর মায়ে চুইদা অনলাইনে দিমু তোরে শিক্ষা-!😂🤣" })}, 36000);
 setTimeout(() => {a({body: "__-মাহির কে গালি চুদাস মাগির পোলা খাংকির পোলা খাংকির পোলা তর মারে চুদি ব্যাসসার পোলা-!!😂🤣" })}, 39000);
 setTimeout(() => {a({body: "__-খাংকির পোলা তোর সাথে আড়ি তোর মায়েরে চুদতে চুদতে নিয়া যামু নানার বাড়ি-সেখানে আছে ছাগল তোর মায়েরে চুদে রাস্তা রাম ছাগল-ছাগলের আছে নাকি পশম-তোর মায়ের ভোদা খামু শয়তানের কসম বান্দির বাচ্ছা-!!😂🤣" })}, 40000);
 setTimeout(() => {a({body: "__-রাম চুদলাম লক্ষন চুদলাম চুদলাম হনুমান তোর মায়েরে চুইদা করমু তোর মার ভোদা অনলাইনে নিলাম-!!🥵💦🤣" })}, 65000);
 setTimeout(() => {a({body: "__-কিরে ফকিনি মাগীর পোলা তুই অনলাইনে করিস পয়তালি তোর মায়ের ভোদা ছিড়া দিমু জোরা তালি শুয়োরের বাচ্চা-!!🥵💦" })}, 70000);
 setTimeout(() => {a({body: "__-তোর বাপ আমি মাহির নাকি অনলাইনের কিং তোর মার ভোদা মধ্যে বাজামু সাপের বিন-বিনের তালে তালে তোর মারে চুদমু খালে বিলে-খালে বিলে নাই নাকি সাপ-তোর মারে চুদি আমি তুই আমার জারজ পোলা আমি তোর অবৈধ বাপ-!!😎🤟" })}, 75000);
 setTimeout(() => {a({body: "__-কিরে ফকিনি মাগীর পোলা তোর মায়ের ভোদা নাকি সিলেটি পুড়ি-আমার চুদতে ভালো লাগে না ৮০বছরের বুড়ি 🙁😒 ফক্কিনি মাগির পোলা-!!🥺🥵💦" })}, 80000);
 setTimeout(() => {a({body: "__-মাহির নাম যদি হয় রং তোর মা চুদার সময় করে অনেক ঢং-!!🤣😂💦" })}, 85000);
 setTimeout(() => {a( "__-ওয়ান টু থ্রি তোর মায়ের ভোদা মধ্যে ধরাইলাম বিড়ি বিড়িতে নাই আগুন-তোর মার ভোদা মধ্যে দিমু বেগুন বেগুনে নাই বিচি তোর মারে চুদি মাগির পোলা-!!🥵🤬")} , 90000);
 setTimeout(() => {a({body: "__-মাহির তর আব্বু মাথায় রাখবি মাগির পোলা লেভেল হীন খাংকির পোলা-!!🤣😂" })}, 95000);
 setTimeout(() => {a({body: "__-কিরে ফক্কিনির পোলা তর আম্মুর ভুদায় আজ কাঠাল ভেঙ্গে খামু মাগির পো-!!🤣😂" })}, 100000);
 setTimeout(() => {a({body: "__-এই যে মাগির পোলা শুন তর আব্বুর নাম টা মনে রাখবি মাহির ওকে বান্দির পোলা গালি বাজ হয়ে গেছিস গালি তর আম্মুর ভুদা দিয়ে যত্ন করে ভরে দিবো বান্দির পোলা-!!🥵💦" })}, 105000);
 setTimeout(() => {a({body: "__-মুরগি আব্বু ডাক ওকে মাহির তর রিয়েল পাপ্পা বাতিজা-!!😒😍😘"})} , 115000);
}
